In [69]:
import sqlite3 as sql
import pandas as pd

In [70]:
sql.sqlite_version

'3.35.5'

In [73]:
db=sql.connect("K-Movies.db")

In [74]:
cursor=db.cursor()
cursor.execute('''CREATE TABLE Movies(id INTEGER PRIMARY KEY AUTOINCREMENT,Movie_Name TEXT,Actor TEXT,
Actress TEXT,Director TEXT,Release_Date TEXT)''')

In [75]:
cursor.execute('''INSERT INTO Movies(Movie_Name,Actor,Actress,Director,Release_date)VALUES(?,?,?,?,?)''',
               ("KGF2","YASH","SRINIDHI SHETTY","PRASHANTH NEEL","14-04-2022"))
cursor.execute('''INSERT INTO Movies(Movie_Name,Actor,Actress,Director,Release_date)VALUES(?,?,?,?,?)''',
               ("JAMES","PUNITH RAJ KUMAR","PRIYA ANAND","CHETHAN KUMAR","17-03-2022"))

In [76]:
cursor.close()
db.commit()

In [77]:
df=pd.read_sql_query("SELECT * FROM Movies",db)
df

,id,Movie_Name,Actor,Actress,Director,Release_Date
0,1,KGF2,YASH,SRINIDHI SHETTY,PRASHANTH NEEL,14-04-2022
1,2,JAMES,PUNITH RAJ KUMAR,PRIYA ANAND,CHETHAN KUMAR,17-03-2022

In [78]:
df=pd.read_sql_query("SELECT Movie_Name FROM Movies",db)
df

  Movie_Name
0       KGF2
1      JAMES

In [79]:
df=pd.read_sql_query("SELECT Actor FROM Movies",db)
df

              Actor
0              YASH
1  PUNITH RAJ KUMAR

In [80]:
df=pd.read_sql_query("SELECT Actress FROM Movies",db)
df

           Actress
0  SRINIDHI SHETTY
1      PRIYA ANAND

In [81]:
df=pd.read_sql_query("SELECT Director FROM Movies",db)
df

         Director
0  PRASHANTH NEEL
1   CHETHAN KUMAR

In [82]:
df=pd.read_sql_query("SELECT Release_Date FROM Movies",db)
df

  Release_Date
0   14-04-2022
1   17-03-2022

In [83]:
db.close()